nxp-mcuxpresso/mcux-sdk/components/internal_flash/mimxrt1170/fsl_adapter_flexspi_nor_flash.c
        key    = DisableGlobalIRQ();
        status = (hal_flash_status_t)FLEXSPI_TransferBlocking(base, &flashXfer);
        /* Do software reset. */
        FLEXSPI_SoftwareReset(base);
        SDK_DelayAtLeastUs(2U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        EnableGlobalIRQ(key);

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
        if (DCacheEnableFlag)
        {
            /* Enable D cache. */
            SCB_EnableDCache();
        }
#endif /* __DCACHE_PRESENT */

#if defined(FSL_FEATURE_SOC_LMEM_COUNT) && (FSL_FEATURE_SOC_LMEM_COUNT == 1U)
        if (CodeCacheEnableFlag)
        {
            /* Enable Code cache. */
            L1CACHE_EnableCodeCache();
        }
#endif /* FSL_FEATURE_SOC_LMEM_COUNT */
    }
    return (hal_flash_status_t)status;
}

/*!
 * @brief Returns the desired hal flash property.
 *
 * @param Property        The desired property from the list of properties in
 *                        enum hal_flash_property_tag_t
 * @param value           A pointer to the value returned for the desired flash property.
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 * @retval #kStatus_HAL_Flash_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_HAL_Flash_Success Flash currently not support.
 */
hal_flash_status_t HAL_FlashGetProperty(hal_flash_property_tag_t property, uint32_t *value)
{
    return kStatus_HAL_Flash_Success;
}

/*!
 * @brief Set the desired hal flash property.
 *
 * @param Property        The desired property from the list of properties in
 *                        enum hal_flash_property_tag_t
 * @param value           The value would be set to the desired flash property.
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 * @retval #kStatus_HAL_Flash_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_HAL_Flash_Success Flash currently not support.
 */
hal_flash_status_t HAL_FlashSetProperty(hal_flash_property_tag_t property, uint32_t value)
{
    return kStatus_HAL_Flash_Success;
}

/*!
 * @brief Returns the security state via the pointer passed into the function.
 *
 * This function retrieves the current flash security status, including the
 * security enabling state and the backdoor key enabling state.
 *
 * @param state           A pointer to the value returned for the current security status
 *
 * @retval #kStatus_HAL_Flash_Success API was executed successfully.
 * @retval #kStatus_HAL_Flash_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_HAL_Flash_Success Flash currently not support.
 */
hal_flash_status_t HAL_FlashGetSecurityState(hal_flash_security_state_t *state)
{
    return kStatus_HAL_Flash_Success;
}
